[
  {
    "name": "DragonFly Cobalt",
    "brand": "Audioquest",
    "category": "Digitalni-u-analogni konverter",
    "subcategory": "USB DAC/Pojačalo za slušalice",
    "series": "DragonFly",
    "description": "Premium USB DAC/pojačalo za slušalice, sa ESS ES9038Q2M čipom i poboljšanim performansama.",
    "longDescription": "Audioquest DragonFly Cobalt je flagship model u popularnoj seriji USB DAC-ova, dizajniran da pruži izuzetno čist i detaljan zvuk sa bilo kog računara, pametnog telefona ili tableta. Koristi napredni ESS ES9038Q2M DAC čip i efikasan ESS SABRE9601 pojačivač za slušalice. Odlikuje ga minimalno izobličenje i poboljšana redukcija šuma zahvaljujući novom ESS monolitnom mikro-kontroleru. Kompaktan, prenosiv i jednostavan za upotrebu, idealan je za audiofile u pokretu koji traže vrhunski kvalitet zvuka.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "DAC čip: ESS ES9038Q2M",
      "Mikro-kontroler: Microchip PIC32MX274",
      "Pojačalo za slušalice: ESS SABRE9601",
      "Podržana rezolucija: Do 24-bit/96kHz (PCM)",
      "Izlazni napon: 2.1V",
      "Kompatibilnost: iOS, Android, macOS, Windows",
      "Dimenzije: 57.5mm x 18.6mm x 11.9mm"
    ]
  },
  {
    "name": "DragonFly Red",
    "brand": "Audioquest",
    "category": "Digitalni-u-analogni konverter",
    "subcategory": "USB DAC/Pojačalo za slušalice",
    "series": "DragonFly",
    "description": "Svestrani USB DAC/pojačalo za slušalice, odličan balans performansi i cene.",
    "longDescription": "Audioquest DragonFly Red je popularan USB DAC i pojačalo za slušalice koje nudi impresivan kvalitet zvuka po pristupačnijoj ceni u odnosu na Cobalt. Koristi ESS 9016 DAC čip i TI OPA1642 pojačivač, pružajući detaljan i dinamičan zvuk. Ima visok izlazni napon od 2.1V, što ga čini pogodnim za širi spektar slušalica, uključujući i one sa višom impedansom. Idealan je za poboljšanje zvuka laptopova, telefona i drugih digitalnih izvora.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "DAC čip: ESS 9016",
      "Pojačalo za slušalice: Texas Instruments OPA1642",
      "Podržana rezolucija: Do 24-bit/96kHz (PCM)",
      "Izlazni napon: 2.1V",
      "Kompatibilnost: iOS, Android, macOS, Windows",
      "Dimenzije: 57.5mm x 18.6mm x 11.9mm"
    ]
  },
  {
    "name": "DragonFly Black",
    "brand": "Audioquest",
    "category": "Digitalni-u-analogni konverter",
    "subcategory": "USB DAC/Pojačalo za slušalice",
    "series": "DragonFly",
    "description": "Ulazni USB DAC/pojačalo za slušalice, odličan za početnike u Hi-Res zvuku.",
    "longDescription": "Audioquest DragonFly Black je najpristupačniji model u DragonFly seriji, idealan ulazak u svet poboljšanog digitalnog zvuka. Iako cenovno povoljniji, i dalje nudi značajno poboljšanje u odnosu na integrisane zvučne kartice, pružajući čistiji i detaljniji zvuk. Koristi ESS 9010 DAC čip i ima izlazni napon od 1.2V, što je dovoljno za većinu slušalica. Odličan je izbor za one koji žele da unaprede svoje audio iskustvo bez velikih investicija.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "DAC čip: ESS 9010",
      "Pojačalo za slušalice: Texas Instruments",
      "Podržana rezolucija: Do 24-bit/96kHz (PCM)",
      "Izlazni napon: 1.2V",
      "Kompatibilnost: iOS, Android, macOS, Windows",
      "Dimenzije: 57.5mm x 18.6mm x 11.9mm"
    ]
  },
  {
    "name": "JitterBug FMJ",
    "brand": "Audioquest",
    "category": "USB Filteri",
    "subcategory": "Optimizatori",
    "series": "JitterBug",
    "description": "USB filter za smanjenje šuma i izobličenja u digitalnom audio signalu.",
    "longDescription": "Audioquest JitterBug FMJ (Full Metal Jacket) je USB filter dizajniran da smanji šum i izobličenje u digitalnom audio signalu. Koristi dvostruki diskretni Noise-Dissipation Circuit kako bi efikasno uklonio RFI/EMI šum koji može uticati na kvalitet zvuka. Može se koristiti u seriji (između USB porta i DAC-a) ili paralelno (u drugi slobodan USB port) za dodatnu redukciju šuma. Njegovo metalno kućište pruža dodatnu zaštitu od smetnji, čineći zvuk jasnijim i prirodnijim.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "Funkcija: Smanjenje RFI/EMI šuma",
      "Povezivanje: USB-A Muški / USB-A Ženski",
      "Tehnologija: Dual Discrete Noise-Dissipation Circuit",
      "Kućište: Metalno (Full Metal Jacket)"
    ]
  },
  {
    "name": "Carbon USB Cable",
    "brand": "Audioquest",
    "category": "Kablovi",
    "subcategory": "USB",
    "series": "Carbon",
    "description": "Visokoperformansni USB kabl sa 5% Silver-plated Long-Grain Copper provodnicima.",
    "longDescription": "Audioquest Carbon USB kabl predstavlja značajan korak napred u kvalitetu digitalnog audio prenosa. Koristi 5% Silver-plated Long-Grain Copper (LGC) provodnike, koji minimiziraju interakciju između niti i poboljšavaju jasnoću signala. Izolacija od tvrde ćelije od pene i dielektrični materijali sa ugljenikom efikasno smanjuju smetnje. Sa preciznom geometrijom i vrhunskim materijalima, Carbon USB kabl obezbeđuje precizan i detaljan prenos digitalnog audio signala, smanjujući digitalni 'jitter'.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "Provodnici: 5% Silver-plated Long-Grain Copper (LGC)",
      "Dielektrik: Solid High-Density Polyethylene",
      "Noise-Dissipation System: Carbon-Based 3-Layer Noise-Dissipation System",
      "Terminacija: Pozlaćeni konektori",
      "Dostupni tipovi: A-B, A-C, C-C, Micro-B, Lightning (za JitterBug)"
    ]
  },
  {
    "name": "Red River RCA Interconnect",
    "brand": "Audioquest",
    "category": "Kablovi",
    "subcategory": "Analogni Interkonekti (RCA)",
    "series": "Rivers",
    "description": "Visokokvalitetni RCA interkonekt kabl sa Long-Grain Copper provodnicima.",
    "longDescription": "Audioquest Red River RCA interkonekt kabl je dizajniran da pruži balansiran i detaljan analogni audio prenos. Koristi Long-Grain Copper (LGC) provodnike, koji smanjuju distorziju i poboljšavaju jasnoću zvuka u poređenju sa standardnim OFHC bakrom. Sa Asymmetrical Double-Balanced geometrijom i Cold-Welded terminacijama, Red River minimizira smetnje i obezbeđuje čvrst kontakt. Njegova Noise-Dissipation System (NDS) tehnologija dodatno štiti signal od RF šuma, rezultirajući čišćim i prirodnijim zvukom.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "Geometrija: Asymmetrical Double-Balanced",
      "Provodnici: Long-Grain Copper (LGC)",
      "Dielektrik: Nitrogen-Injected Foamed-Polyethylene",
      "Noise-Dissipation System: Metal-Layer Noise-Dissipation System (NDS)",
      "Konektori: Hladno zavareni, pozlaćeni RCA"
    ]
  },
  {
    "name": "Forest HDMI Cable",
    "brand": "Audioquest",
    "category": "Kablovi",
    "subcategory": "HDMI",
    "series": "Forest",
    "description": "Osnovni HDMI kabl sa Long-Grain Copper provodnicima za jasan digitalni signal.",
    "longDescription": "Audioquest Forest HDMI kabl je ulazni model u njihovoj liniji HDMI kablova, dizajniran da pruži pouzdan i jasan digitalni video i audio prenos. Koristi Long-Grain Copper (LGC) provodnike i solidnu polietilensku izolaciju kako bi se smanjio džiter i poboljšala jasnoća. Iako je osnovni model, i dalje nudi bolje performanse od standardnih HDMI kablova, obezbeđujući stabilan prenos signala za 4K video i visoko-rezolucioni audio.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "Provodnici: Long-Grain Copper (LGC)",
      "Dielektrik: Solid High-Density Polyethylene",
      "HDMI verzija: Podržava do 4K/60, HDR (zavisno od generacije i dužine)",
      "Ethernet i Audio Return Channel (ARC): Da",
      "Konektori: Pozlaćeni"
    ]
  },
  {
    "name": "Niagara 1200",
    "brand": "Audioquest",
    "category": "Naponski kondicioneri",
    "subcategory": "Filteri",
    "series": "Niagara",
    "description": "Pristupačan naponski kondicioner za poboljšanje audio/video performansi.",
    "longDescription": "Audioquest Niagara 1200 je naponski kondicioner koji pruža efikasnu zaštitu i poboljšanje kvaliteta napajanja za audio i video sisteme. Koristi patentiranu Ground-Noise Dissipation tehnologiju i Transient Power Correction za čišćenje AC napona od šuma i izobličenja, što rezultira tišom pozadinom, većom dinamikom i boljom rezolucijom. Sa 7 AC utičnica (4 Linear Noise-Filtered za digitalne/video komponente, 2 High-Current Low-Z za pojačala, 1 Standard) nudi svestrano rešenje za napajanje celog sistema. Elegantan dizajn omogućava laku integraciju u svaki Hi-Fi setup.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "Tip: Naponski kondicioner / Filter",
      "Ulazni napon: 230VAC (za EU verziju)",
      "Utičnice: 7 AC utičnica (4 filtrirane, 2 High-Current, 1 standardna)",
      "Tehnologije: Ground-Noise Dissipation, Transient Power Correction",
      "Zaštita: Nem-Sacrificial Surge Protection"
    ]
  },
  {
    "name": "Fidelio X3 (Note: This is a Philips model, not Audioquest)",
    "brand": "Audioquest",
    "category": "Slušalice",
    "subcategory": "Over-Ear (Otvorene)",
    "series": "Unknown",
    "description": "Fidelio X3 su vrhunske otvorene slušalice za audiofile sa izuzetnom zvučnom scenom. (NAPOMENA: Ovo je Philips model, nije Audioquest!)",
    "longDescription": "NAPOMENA: Ovaj model (Fidelio X3) je proizvod kompanije Philips, a ne Audioquest. Audioquest se primarno bavi kablovima, DAC-ovima i filterima, a manje slušalicama. Fidelio X3 su zaista izvanredne otvorene slušalice sa 50mm drajverima, luksuznom izradom i izbalansiranim, prostranim zvukom, popularne među audiofilima. Uključeno ovde samo kao primer ako je došlo do zabune pri unosu.",
    "imageUrl": "https://raw.githubusercontent.com/MikiMix-Git/SonusArtBA/refs/heads/main/logos/Audioquest.svg",
    "specifications": [
      "Tip drajvera: Dinamički, 50mm (NAPOMENA: Ovo je za Philips Fidelio X3)",
      "Dizajn: Otvorene, Over-ear (NAPOMENA: Ovo je za Philips Fidelio X3)",
      "Frekventni odziv: 5 - 40,000 Hz (NAPOMENA: Ovo je za Philips Fidelio X3)",
      "Impedansa: 30 Ohm (NAPOMENA: Ovo je za Philips Fidelio X3)",
      "Osetljivost: 100 dB/mW (NAPOMENA: Ovo je za Philips Fidelio X3)",
      "Materijali: Koža, tekstil (NAPOMENA: Ovo je za Philips Fidelio X3)"
    ]
  }
]
