[
  {
    "name": "Acutus Reference Mono SP",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Acutus Reference",
    "description": "Vrhunski referentni gramofon s monoblok pogonom i naprednim sustavom ovjesa.",
    "longDescription": "AVID HIFI Acutus Reference Mono SP je apsolutni vrhunac AVID-ovog inženjeringa gramofona. Dizajniran je za ultimativne audiofilske performanse, s iznimnom izolacijom od vibracija i preciznom kontrolom brzine. Odlikuje ga monoblok pogonski sistem, masivan aluminijski tanjur s dvostrukim prigušenjem, jedinstveni safirni ležaj i napredni sustav ovjesa s prilagodljivom frekvencijom. Ovaj gramofon je sinonim za nekompromisnu vjernost reprodukcije, isporučujući zvuk izvanredne dinamike, detalja i zvučne pozornice. Ukupne dimenzije (uključujući PSU) su približno 460 x 400 x 210mm za gramofon, a PSU ima dimenzije 500 x 450 x 240mm (ŠxDxV).",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/665b5b/ffffff?text=Acutus+Reference+Mono+SP",
    "specifications": [
      "Tip: Referentni gramofon s monoblok pogonom",
      "Pogon: Dvostruki remenski pogon",
      "Tanjur: Dvostruko prigušeni aluminijski tanjur (masa 10kg+)",
      "Ležaj: Ultra tihi safirni ležaj",
      "Ovjes: Trotočkasti sustav s vertikalnim oprugama i horizontalnim o-ring gumama, prilagodljiva frekvencija",
      "Napajanje: Referentno mono napajanje (DSP PSU)",
      "Vibracijska kontrola: Prigušeni subšasija, sustav stezanja u dvije faze",
      "Dimenzije gramofona (ŠxDxV): 460 x 400 x 210mm (ukupno)",
      "Dimenzije PSU (ŠxDxV): 500 x 450 x 240mm",
      "Neto težina: 37.5KG (samo gramofon, bez PSU)"
    ]
  },
  {
    "name": "Acutus Reference SP",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Acutus Reference",
    "description": "Referentni gramofon s poboljšanim napajanjem i sustavom ovjesa.",
    "longDescription": "AVID HIFI Acutus Reference SP je napredni gramofon koji redefinira standarde u visokoj vjernosti. Opremljen je referentnim DSP napajanjem, koje osigurava izuzetno stabilnu i preciznu kontrolu brzine motora. Gramofon ima prigušeni subšasija i sustav ovjesa s prilagodljivom frekvencijom, što osigurava iznimnu izolaciju od vanjskih vibracija. Visoko-momentni pogonski motor ručne izrade i sustav stezanja u dvije faze doprinose nevjerojatnoj dinamici i jasnoći zvuka. Dizajniran je za vrhunsku analognu reprodukciju, pružajući izuzetno detaljan i dinamičan zvuk.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/7a7a7a/ffffff?text=Acutus+Reference+SP",
    "specifications": [
      "Tip: Referentni gramofon",
      "Pogon: Dvostruki remenski pogon",
      "Tanjur: Dvostruko prigušeni aluminijski tanjur",
      "Ležaj: Ultra tihi safirni ležaj",
      "Ovjes: Vibracijski podešena subšasija, prilagodljiva frekvencija ovjesa",
      "Napajanje: Referentno DSP napajanje",
      "Vibracijska kontrola: Sustav stezanja u dvije faze"
    ]
  },
  {
    "name": "Acutus Classic",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Acutus",
    "description": "Originalni premijerni gramofon s klasičnim napajanjem i vrhunskim ležajem.",
    "longDescription": "AVID HIFI Acutus Classic je originalni premijerni gramofon koji je postavio temelje AVID-ove reputacije. Ovaj model koristi klasično napajanje s podesivom brzinom, dvostruko prigušeni aluminijski tanjur i ultra tihi safirni ležaj. Sustav stezanja u dvije faze osigurava optimalan kontakt ploče s tanjurom, minimizirajući vibracije i maksimizirajući izvučene detalje iz vinila. Acutus Classic je cijenjen zbog svoje robusne konstrukcije i sposobnosti da isporuči iznimno stabilan i transparentan zvuk.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/a8a8a8/ffffff?text=Acutus+Classic",
    "specifications": [
      "Tip: Premijerni gramofon",
      "Napajanje: Klasično napajanje s podesivom brzinom",
      "Tanjur: Dvostruko prigušeni aluminijski tanjur",
      "Ležaj: Ultra tihi safirni ležaj",
      "Vibracijska kontrola: Sustav stezanja u dvije faze"
    ]
  },
  {
    "name": "Acutus DARK Ltd Edition",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Acutus",
    "description": "Limitirano izdanje Acutus gramofona s upečatljivom tamnom estetikom.",
    "longDescription": "AVID HIFI Acutus DARK Ltd Edition je vizualno zapanjujuće limitirano izdanje Acutus gramofona, koje kombinira klasično AVID inženjerstvo s jedinstvenom tamnom estetikom. Zadržava sve audiofilske kvalitete Acutus Classic modela, uključujući klasično napajanje s podesivom brzinom i ultra tihi safirni ležaj. Opcijski mat od smole za tanjur i sustav stezanja dodatno doprinose performansama i izgledu. Ovo je kolekcionarski primjerak koji pruža izvanredan zvuk i jedinstven stil.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/36454F/ffffff?text=Acutus+DARK+Ltd+Edition",
    "specifications": [
      "Tip: Limitirano izdanje gramofona",
      "Boja: Tamna (DARK IRON)",
      "Napajanje: Klasično napajanje s podesivom brzinom",
      "Ležaj: Ultra tihi safirni ležaj",
      "Dodaci: Opcijski mat od smole za tanjur, opcijski sustav stezanja"
    ]
  },
  {
    "name": "Volvere",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Volvere",
    "description": "Gramofon s prigušenim tanjurom i frekvencijski podesivim ovjesom.",
    "longDescription": "AVID HIFI Volvere je gramofon koji nudi izvanredne performanse zahvaljujući svom dizajnu. Posjeduje tanjur s periferijskim prigušenjem, napajanje s podesivom brzinom i ultra tihi safirni ležaj. Sustav ovjesa s prilagodljivom frekvencijom osigurava optimalnu izolaciju od vibracija. Sa visokim momentom pogonskog motora (55mN), Volvere pruža stabilnu i dinamičnu reprodukciju zvuka, čineći ga odličnim izborom za ozbiljne ljubitelje vinila.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/4a4e69/ffffff?text=AVID+Volvere",
    "specifications": [
      "Tip: Gramofon",
      "Pogon: Visok moment pogonskog motora (55mN)",
      "Tanjur: Tanjur s periferijskim prigušenjem",
      "Ležaj: Ultra tihi safirni ležaj",
      "Ovjes: Frekvencijski podesiv ovjes",
      "Napajanje: Napajanje s podesivom brzinom",
      "Dimenzije (ŠxDxV): 425 x 370 x 205mm (ukupno)",
      "Neto težina: 12.5KG (bez PSU)"
    ]
  },
  {
    "name": "Sequel",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Sequel",
    "description": "Gramofon s poboljšanom kontrolom vibracija i dvostrukim remenskim pogonom.",
    "longDescription": "AVID HIFI Sequel je gramofon koji nadograđuje Volvere filozofiju, nudeći poboljšanu kontrolu vibracija i preciznost. Odlikuje ga tanjur s periferijskim prigušenjem, klasično napajanje s podesivom brzinom i vibracijski podešena subšasija. Dvostruki remenski pogonski sustav i visok moment pogonskog motora (140mN) osiguravaju izuzetnu stabilnost i dinamičnu reprodukciju. Sequel je dizajniran da pruži izuzetno čist i detaljan zvuk, minimalizirajući smetnje iz okoline.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/6a040f/ffffff?text=AVID+Sequel",
    "specifications": [
      "Tip: Gramofon",
      "Pogon: Dvostruki remenski pogon, visok moment pogonskog motora (140mN)",
      "Tanjur: Tanjur s periferijskim prigušenjem",
      "Ovjes: Vibracijski podešena subšasija",
      "Napajanje: Klasično napajanje s podesivom brzinom"
    ]
  },
  {
    "name": "Diva II SP",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Diva",
    "description": "Unaprijeđeni Diva model s teškim prigušenim tanjurom i dvostrukim remenskim pogonom.",
    "longDescription": "AVID HIFI Diva II SP je unaprijeđeni gramofon iz Diva serije, dizajniran da pruži dublji uvid u glazbu. Karakterizira ga težak 6.3kg prigušeni tanjur, napajanje s podesivom brzinom (SP Power Supply) i vibracijski podešena subšasija. Sustav stezanja za prijenos vibracija i dvostruki remenski pogon osiguravaju izvanrednu stabilnost i preciznost. Diva II SP nudi poboljšanu definiciju basa i visokih tonova, pružajući gladak, ali dinamičan zvuk.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/8d8d8d/ffffff?text=AVID+Diva+II+SP",
    "specifications": [
      "Tip: Gramofon",
      "Pogon: Dvostruki remenski pogon",
      "Tanjur: Težak 6.3Kg prigušeni tanjur",
      "Ovjes: Vibracijski podešena subšasija",
      "Napajanje: Napajanje s podesivom brzinom (SP PSU)",
      "Vibracijska kontrola: Sustav stezanja za prijenos vibracija"
    ]
  },
  {
    "name": "Diva II",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Diva",
    "description": "Gramofon s teškim prigušenim tanjurom i trostrukim elastomernim ovjesom.",
    "longDescription": "AVID HIFI Diva II je gramofon koji nudi izvanredne performanse u svojoj klasi. Opremljen je teškim 5.5kg prigušenim tanjurom i ultra tihim safirnim ležajem. Vibracijski podešena subšasija i trostruki elastomerni ovjes osiguravaju iznimnu izolaciju od neželjenih vibracija. Sustav stezanja za prijenos vibracija doprinosi čvrstom kontaktu ploče s tanjurom, rezultirajući čistim i dinamičnim zvukom.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/b0b0b0/ffffff?text=AVID+Diva+II",
    "specifications": [
      "Tip: Gramofon",
      "Tanjur: Težak 5.5Kg prigušeni tanjur",
      "Ležaj: Ultra tihi safirni ležaj",
      "Ovjes: Vibracijski podešena subšasija, trostruki elastomerni ovjes",
      "Vibracijska kontrola: Sustav stezanja za prijenos vibracija"
    ]
  },
  {
    "name": "Ingenium Plug&Play",
    "brand": "AVID HIFI",
    "category": "Gramofoni",
    "series": "Ingenium",
    "description": "Plug&Play gramofon dizajniran za jednostavnu upotrebu i visokokvalitetnu reprodukciju vinila.",
    "longDescription": "AVID HIFI Ingenium Plug&Play je gramofon osmišljen za ljubitelje vinila koji traže jednostavnost i izvanredan zvuk. Ovaj model nudi dvije brzine (33.3 i 45 RPM) i ima tanjur mase 2.5kg. Pokreće ga 12mNm AC sinhroni motor, a naponski ulaz je 100-240VAC 50/60Hz. Sa dimenzijama 370 x 305 x 130 mm (ŠxDxV) i impresivnom neto težinom, Ingenium Plug&Play je spreman za upotrebu odmah po raspakiravanju, pružajući čisti analogni zvuk bez nepotrebnih komplikacija. Uključuje ručku i zvučnicu.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/606c38/ffffff?text=AVID+Ingenium+Plug%26Play",
    "specifications": [
      "Brzine: 33.3 & 45.0 o/min",
      "Masa platinja (tanjura): 2.5KG (aluminijski)",
      "Motor: 12mNm AC sinhroni",
      "Naponski ulaz: 100-240VAC 50/60Hz 4W Max",
      "Dimenzije (ŠxDxV): 370 x 305 x 130 mm (ukupno)",
      "Neto težina: Nije precizirano (referenca na slične modele ukazuje na oko 5-7kg)",
      "Dodaci: Isporučuje se s ručkom i zvučnicom"
    ]
  },
  {
    "name": "Pulsare II",
    "brand": "AVID HIFI",
    "category": "Phono Pojačala",
    "series": "Pulsare",
    "description": "Napredno phono pojačalo s opsežnim podešavanjima za preciznu reprodukciju.",
    "longDescription": "AVID HIFI Pulsare II je napredno phono pojačalo koje nudi izuzetnu fleksibilnost i preciznost za zahtjevne audiofile. Omogućava podešavanje pojačanja (Gain) od 40dB, 50dB, 60dB i 70dB, te širok spektar opterećenja otpora (Resistance) od 10R do 47K, uključujući i opciju za prilagođeno podešavanje. Kapacitet se može birati između 100pf, 200pf, 500pf, 1.5nf, 10nf i 20nf. Ugrađen je i subsonični filter prvog reda sa slopom od -3dB@10Hz. Ovi opsežni parametri omogućavaju optimalno usklađivanje s gotovo bilo kojom zvučnicom, osiguravajući da je vinilna reprodukcija maksimalno vjerna originalu. Posebno je dizajnirano s visokokvalitetnim komponentama i potpuno balansiranom arhitekturom.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/40916c/ffffff?text=AVID+Pulsare+II+Phono",
    "specifications": [
      "Pojačanje (Gain): 40dB -50dB -60dB -70dB",
      "Otpor (Resistance): 10R-30R-100R-300R-500R-1K-5k-10K-47K-CUSTOM",
      "Kapacitet (Capacitance): 100pf - 200pf - 500pf - 1.5nf - 10nf - 20nf",
      "Subsonični filter: 1. red slope, -3dB@10Hz",
      "Arhitektura: Potpuno balansirana",
      "Buka: Niska",
      "Distorzija: Izuzetno niska"
    ]
  },
  {
    "name": "Pellere",
    "brand": "AVID HIFI",
    "category": "Phono Pojačala",
    "series": "Pellere",
    "description": "Phono pojačalo koje nudi izvrsne performanse po pristupačnijoj cijeni.",
    "longDescription": "AVID HIFI Pellere je phono pojačalo dizajnirano da pruži performanse bliske višim modelima AVID-a, čineći visoku vjernost pristupačnijom. Opremljeno je iznimnim rasponom podešavanja putem prekidača na donjoj strani jedinice, što omogućuje prilagodbu različitim zvučnicama. Koristi pasivnu RIAA korekciju (s Neumann HF korekcijom) s kondenzatorima tolerancije unutar 1%. Eksterno regulirano 300VA napajanje osigurava namjensko napajanje za svaki kanal, minimizirajući šum i distorziju. Dizajnirano je, proizvedeno i testirano u Huntingdonu, osiguravajući dugovječnost i fleksibilnost.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/5a915f/ffffff?text=AVID+Pellere+Phono",
    "specifications": [
      "Tip: Phono pojačalo",
      "Podešavanje: Raspon podešavanja putem prekidača (Gain, Resistance, Capacitance)",
      "RIAA: Pasivna RIAA (s Neumann HF korekcijom)",
      "Napajanje: Eksterno regulirano 300VA napajanje",
      "Buka: < -81dB MM, < -67dB MC",
      "Distorzija: < 0.001% RIAA: 5Hz – 70kHz ±0.5dB",
      "Pojačanje (Gain): 48dB - 60dB - 70dB (podesivo)",
      "Otpor (Resistance): 47k - Custom (podesivo)",
      "Kapacitet (Capacitance): 100pf (podesivo)",
      "Dimenzije (ŠxDxV): 120 x 230 x 70mm (Phono jedinica)",
      "Neto težina: 1.6Kg (Phono jedinica), 2.2Kg (Pakiranje)"
    ]
  },
  {
    "name": "Pellar Phono",
    "brand": "AVID HIFI",
    "category": "Phono Pojačala",
    "series": "Pellar",
    "description": "Visokokvalitetno phono pojačalo koje nudi izvanrednu preciznost i dinamiku.",
    "longDescription": "AVID HIFI Pellar Phono je visokokvalitetno phono pojačalo dizajnirano da izvuče najbolje iz vaše vinilne kolekcije. Sa mogućnošću podešavanja pojačanja (Gain) od 40dB, 50dB, 60dB i 70dB, prilagodljiv je za različite tipove zvučnica (MM/MC). Nudi širok raspon podešavanja otpora (Resistance) od 10R do 47K i kapaciteta (Capacitance) od 100pf do 20nf. Sa izuzetno niskom razinom buke (< -81dB MM, < -67dB MC) i niskom distorzijom (< 0.001%), Pellar Phono osigurava kristalno čist zvuk. Izlazna impedansa je 20Ω, a napajanje je interno regulirano s 24VA transformatorom. Dimenzije su 120 x 230 x 70mm (ŠxDxV), a neto težina 1.6kg.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/1b4332/ffffff?text=AVID+Pellar+Phono",
    "specifications": [
      "Buka: < -81dB MM, < -67dB MC",
      "Distorzija: < 0.001% RIAA: 5Hz – 70kHz ±0.5dB",
      "Pojačanje (Gain): 40dB - 50dB - 60dB - 70dB",
      "Otpor (Resistance): 10R-30R-100R-300R-500R-1K-5K-10K-47K",
      "Kapacitet (Capacitance): 100pf – 200pf – 500pf – 1.5nf – 10nf – 20nf",
      "Izlazna impedansa: 20Ω",
      "Napajanje: Interno regulirano sa 24VA transformatorom",
      "Naponski ulaz: 100-240VAC 50/60Hz 10 WATTS MAX",
      "Dimenzije (ŠxDxV): 120 x 230 x 70mm",
      "Neto težina: 1.6Kg (3.5lb)"
    ]
  },
  {
    "name": "Pulsus",
    "brand": "AVID HIFI",
    "category": "Phono Pojačala",
    "series": "Pulsus",
    "description": "Phono pojačalo koje donosi principe viših modela u pristupačniji format.",
    "longDescription": "AVID HIFI Pulsus je phono pojačalo koje zadržava principe i koncept viših modela, poput Pulsare II, nudeći fleksibilnost podešavanja pojačanja, otpora i kapaciteta putem prekidača na donjoj osnovnoj ploči. Osigurava izvrsnu kvalitetu zvuka s niskom razinom buke i transparentnom reprodukcijom, čineći ga idealnim izborom za poboljšanje performansi gramofona. Podržava neuravnotežene RCA ulaze s pozlaćenim konektorima.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/6b8e23/ffffff?text=AVID+Pulsus+Phono",
    "specifications": [
      "Tip: Phono pojačalo",
      "Podešavanje: Fleksibilno podešavanje pojačanja, otpora i kapaciteta putem prekidača",
      "Ulazi: Neuravnoteženi RCA ulazi"
    ]
  },
  {
    "name": "Reference Pre-Amplifier",
    "brand": "AVID HIFI",
    "category": "Pretpojačala",
    "series": "Reference",
    "description": "Vrhunsko pretpojačalo za apsolutnu transparentnost i kontrolu audio signala.",
    "longDescription": "AVID HIFI Reference Pre-Amplifier je dizajniran kao referentni standard u svijetu pretpojačala, s ciljem pružanja apsolutne transparentnosti i neusporedive kontrole audio signala. Njegova konstrukcija i komponente optimizirane su za minimalnu buku i distorziju, osiguravajući da svaki detalj glazbe bude precizno reproduciran. Idealno je za najzahtjevnije audio sustave gdje je svaki element bitan za postizanje vrhunskog zvučnog iskustva.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/3a5a40/ffffff?text=AVID+Reference+Pre+Amp",
    "specifications": [
      "Tip: Stereo pretpojačalo",
      "Dizajn: Minimalna buka i distorzija, maksimalna transparentnost"
    ]
  },
  {
    "name": "Reference Mono Power Amplifier",
    "brand": "AVID HIFI",
    "category": "Izlazna Pojačala",
    "series": "Reference",
    "description": "Monoblok izlazna pojačala za ogromnu snagu i kontrolu zvučnika.",
    "longDescription": "AVID HIFI Reference Mono Power Amplifier su monoblok izlazna pojačala dizajnirana da pruže ogromnu snagu i izvanrednu kontrolu zvučnika. Sa svojom robusnom konstrukcijom i visokokvalitetnim komponentama, ova pojačala su sposobna pokretati i najzahtjevnije zvučnike s lakoćom. Posebno su optimizirana za isporuku preciznog i dinamičnog zvuka, bez obzira na razinu glasnoće. Idealna su za stereo sustave gdje je potrebna apsolutna kontrola i performanse bez kompromisa.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/4e3c23/ffffff?text=AVID+Reference+Mono+Amp",
    "specifications": [
      "Tip: Monoblok izlazna pojačala",
      "Snaga: Ogromna snaga (specifična W nije uvijek lako dostupna)",
      "Kontrola: Izvanredna kontrola zvučnika"
    ]
  },
  {
    "name": "Reference Stereo Power Amplifier",
    "brand": "AVID HIFI",
    "category": "Izlazna Pojačala",
    "series": "Reference",
    "description": "Stereo izlazno pojačalo koje kombinira snagu monoblokova s praktičnošću stereo konfiguracije.",
    "longDescription": "AVID HIFI Reference Stereo Power Amplifier nudi performanse referentne klase u stereo konfiguraciji. Kombinira snagu i preciznost AVID-ovih monoblok pojačala s praktičnošću jednog kućišta. Dizajniran je za reprodukciju glazbe s iznimnom jasnoćom, dinamikom i dubinom, osiguravajući potpunu kontrolu nad zvučnicima. Ovo pojačalo je idealno za audiofile koji traže vrhunske performanse u stereo sustavu, bez potrebe za dva odvojena monobloka.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/6c7a89/ffffff?text=AVID+Reference+Stereo+Amp",
    "specifications": [
      "Tip: Stereo izlazno pojačalo",
      "Kategorija: Referentna klasa",
      "Performanse: Visoka snaga i kontrola zvučnika"
    ]
  },
  {
    "name": "Accent Integrated Amplifier",
    "brand": "AVID HIFI",
    "category": "Integrirana Pojačala",
    "series": "Accent",
    "description": "Integrirano pojačalo s impresivnom snagom i niskom distorzijom, uključuje phono ulaz.",
    "longDescription": "AVID HIFI Accent Integrated Amplifier je snažno integrirano pojačalo koje pruža impresivne performanse i fleksibilnost. Nudi izlaznu snagu od 70W po kanalu na 8Ω, s vrlo niskom harmonijskom distorzijom od 0.03% (pri 80% snage na 8Ω, 1KHz), osiguravajući čist i precizan zvuk. Podržava zvučnike impedanse od 4 do 16Ω. Sadrži Phono ulaze (1x RCA s opcijom loadinga) s podesivim pojačanjem (Gain) od 48dB, 60dB i 70dB, te ulaznim otporom (Resistance) od 47K Ohm i podesivim kapacitetom. Opremljen je i linijskim ulazima. Pojačalo radi na 115V ili 230V AC. Dimenzije su 470 x 410 x 110mm (ŠxDxV).",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/a3b18a/ffffff?text=AVID+Accent+Amp",
    "specifications": [
      "Izlazna snaga: 70W na 8Ω",
      "Harmonijska distorzija: 0.03% (80% snage 8Ω 1KHz)",
      "Impedansa zvučnika: 4-16Ω",
      "Phono ulazi: 1x RCA, 1x Loading (podesivo Gain, Resistance, Capacitance)",
      "Phono pojačanje (Gain): 48dB – 60dB – 70dB",
      "Phono ulazni otpor: 47K – CUSTOM (500Ω LOADING PLUGS SUPPLIED)",
      "Phono ulazni kapacitet: 100pF",
      "Linijski ulazi: Da",
      "Naponski ulaz: 115V OR 230V AC",
      "Dimenzije (ŠxDxV): 470 x 410 x 110mm"
    ]
  },
  {
    "name": "Sigsum Integrated Amplifier",
    "brand": "AVID HIFI",
    "category": "Integrirana Pojačala",
    "series": "Sigsum",
    "description": "Integrirano pojačalo s vrhunskim performansama i izuzetnom kontrolom.",
    "longDescription": "AVID HIFI Sigsum Integrated Amplifier je dizajniran da pruži izuzetnu kontrolu i muzikalnost u jednom kućištu. Kao visokopozicionirano integrirano pojačalo, fokusira se na čistoću signala i sposobnost da pokreće širok raspon zvučnika s lakoćom. Njegova arhitektura je optimizirana za minimalne smetnje i maksimalnu transparentnost, pružajući angažirajući i dinamičan zvuk. Sigsum je idealan za one koji traže pojednostavljen, ali nekompromisan Hi-Fi sustav.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/c7cfb7/ffffff?text=AVID+Sigsum+Amp",
    "specifications": [
      "Tip: Integrirano pojačalo",
      "Dizajn: Optimizirano za čistoću signala i minimalne smetnje",
      "Kontrola: Izuzetna kontrola zvučnika"
    ]
  },
  {
    "name": "Integra Integrated Amplifier",
    "brand": "AVID HIFI",
    "category": "Integrirana Pojačala",
    "series": "Integra",
    "description": "Kompaktno integrirano pojačalo koje pruža visokokvalitetan zvuk u elegantnom pakiranju.",
    "longDescription": "AVID HIFI Integra Integrated Amplifier je kompaktno i elegantno integrirano pojačalo koje donosi prepoznatljivu AVID kvalitetu zvuka. Dizajnirano je za optimalnu integraciju u manje prostore, a istovremeno pruža snažnu i detaljnu audio reprodukciju. Njegova jednostavnost korištenja i visoke performanse čine ga idealnim izborom za ljubitelje glazbe koji traže uravnotežen i transparentan zvuk bez kompromisa na prostoru.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/d9ed92/ffffff?text=AVID+Integra+Amp",
    "specifications": [
      "Tip: Integrirano pojačalo",
      "Dizajn: Kompaktno i elegantno"
    ]
  },
  {
    "name": "Celsus Pre Power Amplifier",
    "brand": "AVID HIFI",
    "category": "Pojačala",
    "series": "Celsus",
    "description": "Kombinacija pretpojačala i izlaznog pojačala u jednoj jedinici s visokom snagom.",
    "longDescription": "AVID HIFI Celsus Pre Power Amplifier je moćno pojačalo koje objedinjuje pretpojačalo i izlazno pojačalo u jednoj jedinici, nudeći visoku snagu i kvalitetu zvuka. Dizajnirano je za pružanje izuzetne dinamike i kontrole, s fokusom na vjernu reprodukciju audio signala. Idealno je za korisnike koji traže snažno i integrirano rješenje za svoj audio sustav, s minimalnim kabliranjem i maksimalnim performansama.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/e9d8a6/ffffff?text=AVID+Celsus+Amp",
    "specifications": [
      "Tip: Pre/Power pojačalo (integrirano)",
      "Dizajn: Visoka snaga, dinamika i kontrola"
    ]
  },
  {
    "name": "Reference Four",
    "brand": "AVID HIFI",
    "category": "Zvučnici",
    "series": "Reference",
    "description": "Flagship podnostojeći zvučnik iz referentne serije, za koncertne razine zvuka.",
    "longDescription": "AVID HIFI Reference Four je flagship podnostojeći zvučnik iz njihove referentne serije, dizajniran da pruži zvuk na razini koncerta. Izrađen je s potpunom aluminijskom konstrukcijom kućišta i koristi napredne tehnike prigušenja mase drajvera te kompresijsko stezanje drajvera za minimalnu obojenost basa. Cilj mu je isporučiti izuzetno precizan, dinamičan i transparentan zvuk, s dubokim i kontroliranim basom, što ga čini idealnim za najzahtjevnije audiofilske sustave.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/7c6a6a/ffffff?text=AVID+Reference+Four",
    "specifications": [
      "Tip: Samostojeći zvučnik",
      "Konstrukcija: Potpuna aluminijska konstrukcija kućišta",
      "Značajke: Prigušenje mase drajvera, kompresijsko stezanje drajvera, niska obojenost basa"
    ]
  },
  {
    "name": "Reference Three",
    "brand": "AVID HIFI",
    "category": "Zvučnici",
    "series": "Reference",
    "description": "Podnostojeći zvučnik s vrhunskom aluminijskom konstrukcijom i kontroliranim basom.",
    "longDescription": "AVID HIFI Reference Three je podnostojeći zvučnik iz referentne serije, koji pruža izuzetnu detaljnost i dinamičnost. Odlikuje ga potpuna aluminijska konstrukcija, prigušenje mase drajvera i kompresijsko stezanje drajvera, što rezultira niskom obojenošću basa i visokom rezolucijom zvuka. Dizajniran je za besprijekornu reprodukciju glazbe, nudeći prostranu zvučnu sliku i precizan bas. Idealna je opcija za srednje do veće prostore.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/a38b8b/ffffff?text=AVID+Reference+Three",
    "specifications": [
      "Tip: Samostojeći zvučnik",
      "Konstrukcija: Potpuna aluminijska konstrukcija kućišta",
      "Značajke: Prigušenje mase drajvera, kompresijsko stezanje drajvera, niska obojenost basa"
    ]
  },
  {
    "name": "Reference Two",
    "brand": "AVID HIFI",
    "category": "Zvučnici",
    "series": "Reference",
    "description": "Kompaktni samostojeći zvučnik iz referentne serije s aluminijskim kućištem.",
    "longDescription": "AVID HIFI Reference Two je kompaktni samostojeći zvučnik iz referentne serije, koji nudi impresivne performanse unatoč svojoj veličini. Izgrađen je s aluminijskim kućištem za iznimnu rigidnost i kontrolu vibracija. Pruža balans između veličine i performansi, nudeći prostranu zvučnu sliku i detaljan zvuk. Idealno je rješenje za sobe gdje je prostor ograničen, ali se ne želi kompromitirati na kvaliteti zvuka.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/b6a2a2/ffffff?text=AVID+Reference+Two",
    "specifications": [
      "Tip: Samostojeći zvučnik",
      "Konstrukcija: Aluminijsko kućište"
    ]
  },
  {
    "name": "Reference One",
    "brand": "AVID HIFI",
    "category": "Zvučnici",
    "series": "Reference",
    "description": "Najkompaktniji referentni zvučnik, dizajniran za preciznu i detaljnu reprodukciju.",
    "longDescription": "AVID HIFI Reference One je najkompaktniji zvučnik u referentnoj seriji, ali pruža izuzetno preciznu i detaljnu reprodukciju zvuka. Dizajniran je s istom pažnjom prema detaljima i kontroli vibracija kao i veći modeli. Nudi impresivnu zvučnu pozornicu i dinamički raspon za svoju veličinu, što ga čini pogodnim za manje prostore ili kao dio višekanalnog sustava.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/d0c0c0/ffffff?text=AVID+Reference+One",
    "specifications": [
      "Tip: Samostojeći zvučnik (kompaktan)",
      "Značajke: Precizna i detaljna reprodukcija"
    ]
  },
  {
    "name": "EVO FOUR",
    "brand": "AVID HIFI",
    "category": "Zvučnici",
    "series": "EVO",
    "description": "Samostojeći zvučnik s visokom rezolucijom zvuka i dinamičnim bas odgovorom.",
    "longDescription": "AVID HIFI EVO FOUR je samostojeći zvučnik koji nudi visoku rezoluciju zvuka i impresivan dinamičan bas odgovor. Dizajniran je s prigušenjem mase drajvera i reflex port dizajnom, osiguravajući čvrst i kontroliran bas, te transparentne srednje i visoke tonove. EVO FOUR pruža angažirajući i punokrvan zvuk, idealan za ljubitelje glazbe koji cijene detalje i snagu u svojoj reprodukciji.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/5c8567/ffffff?text=AVID+EVO+FOUR",
    "specifications": [
      "Tip: Samostojeći zvučnik",
      "Značajke: Visoka rezolucija zvuka, dinamičan bas odgovor, prigušenje mase drajvera, Reflex Port dizajn"
    ]
  },
  {
    "name": "EVO THREE",
    "brand": "AVID HIFI",
    "category": "Zvučnici",
    "series": "EVO",
    "description": "Kompaktniji samostojeći zvučnik iz EVO serije, s fokusom na detaljan zvuk i dinamičan raspon.",
    "longDescription": "AVID HIFI EVO THREE je kompaktniji samostojeći zvučnik iz EVO serije, dizajniran da pruži detaljan zvuk i dinamičan raspon u manjem formatu. Koristi slične tehnologije prigušenja mase drajvera i optimizacije kućišta kao i veći EVO modeli, osiguravajući minimalne rezonancije i čistu reprodukciju. Idealno je za prostore gdje je prostor faktor, ali se ne želi žrtvovati kvaliteta zvuka.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/7a9a8d/ffffff?text=AVID+EVO+THREE",
    "specifications": [
      "Tip: Samostojeći zvučnik (kompaktan)",
      "Značajke: Detaljan zvuk, dinamičan raspon, prigušenje mase drajvera"
    ]
  },
  {
    "name": "Nexus Tonearm",
    "brand": "AVID HIFI",
    "category": "Ručke gramofona",
    "series": "Nexus",
    "description": "Flagship ručka gramofona s titanijskom cijevi i preciznim ležajevima.",
    "longDescription": "AVID HIFI Nexus Tonearm je flagship ručka gramofona dizajnirana za izvanrednu preciznost i stabilnost. Odlikuje je 9-inčni ball-race ležaj i lagana, ali rigidna titanijska cijev. S efektivnom dužinom od 233mm, razmakom montaže od 216mm, kutom pomaka od 23° i prevjesom od 17mm, optimizirana je za precizno praćenje utora vinila. Efektivna masa od 18g svrstava je u srednju kategoriju. Teži 880g i dolazi s odvojivim 1.3m kablom s 5-pinskim DIN konektorom (RCA ili opcijski balansirani XLR izlazi). Estetski se savršeno uklapa u AVID-ove gramofone.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/34495e/ffffff?text=AVID+Nexus+Tonearm",
    "specifications": [
      "Tip: Ručka gramofona",
      "Ležaj: 9″ ball-race ležaj",
      "Cijev ručke: Titanijska",
      "Efektivna dužina: 233mm",
      "Razmak montaže: 216mm",
      "Kut pomaka (Offset angle): 23°",
      "Prevjes (Overhang): 17mm",
      "Efektivna masa: Srednja / 18g",
      "Težina: 880g",
      "Kabel: 1.3m odvojivi 5 Pin DIN konektor (RCA ili opcijski XLR)"
    ]
  },
  {
    "name": "Altus Tonearm",
    "brand": "AVID HIFI",
    "category": "Ručke gramofona",
    "series": "Altus",
    "description": "Visokokvalitetna ručka gramofona dizajnirana za detaljnu i kontroliranu reprodukciju.",
    "longDescription": "AVID HIFI Altus Tonearm je visokokvalitetna ručka gramofona koja pruža detaljnu i kontroliranu reprodukciju. Njegov dizajn fokusira se na minimaliziranje rezonancija i osiguravanje preciznog praćenja. Iako su specifikacije manje detaljno opisane nego za Nexus, Altus je pozicioniran kao izvrsna opcija za nadogradnju AVID gramofona ili za upotrebu s drugim visokokvalitetnim gramofonima.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/5e6472/ffffff?text=AVID+Altus+Tonearm",
    "specifications": [
      "Tip: Ručka gramofona",
      "Dizajn: Minimalizacija rezonancija, precizno praćenje"
    ]
  },
  {
    "name": "Reference Ruby",
    "brand": "AVID HIFI",
    "category": "Zvučnice",
    "series": "Reference",
    "description": "Vrhunska MC zvučnica za ultimativnu rezoluciju i transparentnost zvuka.",
    "longDescription": "AVID HIFI Reference Ruby je vrhunska pokretna zavojnica (MC) zvučnica, dizajnirana kao referentni standard za reprodukciju vinila. Izrađena s iznimnom preciznošću i koristeći najbolje materijale, pruža ultimativnu rezoluciju, transparentnost i dinamički raspon. Cilj joj je izvući svaki mogući detalj iz utora ploče, stvarajući imerzivnu i realističnu zvučnu sliku. Idealna je za najzahtjevnije audiofilske sustave.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/8b0000/ffffff?text=AVID+Reference+Ruby",
    "specifications": [
      "Tip: Pokretna zavojnica (MC) zvučnica",
      "Materijal konzole: Rubina (Ruby)",
      "Performanse: Ultimativna rezolucija, transparentnost, dinamički raspon"
    ]
  },
  {
    "name": "Boron",
    "brand": "AVID HIFI",
    "category": "Zvučnice",
    "series": "Boron",
    "description": "Visokokvalitetna MC zvučnica s boronskom konzolom za izbalansiran zvuk.",
    "longDescription": "AVID HIFI Boron je visokokvalitetna pokretna zavojnica (MC) zvučnica koja koristi boronsku konzolu za izvanredan izbalansiran zvuk s bogatim detaljima. Boron je poznat po svojoj krutosti i lakoći, što omogućava precizno praćenje i minimalne rezonancije. Ova zvučnica pruža prirodnu tonalnu ravnotežu i izuzetnu mikro-dinamiku, čineći je odličnim izborom za širok spektar glazbenih žanrova i audio sustava.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/40e0d0/ffffff?text=AVID+Boron+Cartridge",
    "specifications": [
      "Tip: Pokretna zavojnica (MC) zvučnica",
      "Materijal konzole: Boron (Boron)"
    ]
  },
  {
    "name": "Ionic",
    "brand": "AVID HIFI",
    "category": "Zvučnice",
    "series": "Ionic",
    "description": "MC zvučnica s visokim performansama koja pruža dinamičan i angažirajući zvuk.",
    "longDescription": "AVID HIFI Ionic je pokretna zavojnica (MC) zvučnica visokih performansi dizajnirana da pruži dinamičan i angažirajući zvuk. Fokusira se na isporuku snažnog basa, jasnih srednjih tonova i detaljnih visokih tonova, stvarajući uzbudljivo iskustvo slušanja. Ionic je idealan za one koji traže živahan i precizan zvuk iz svoje vinilne kolekcije, nudeći izvrstan omjer cijene i performansi unutar AVID asortimana zvučnica.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/a3b18a/ffffff?text=AVID+Ionic+Cartridge",
    "specifications": [
      "Tip: Pokretna zavojnica (MC) zvučnica",
      "Performanse: Dinamičan i angažirajući zvuk"
    ]
  },
  {
    "name": "Platform",
    "brand": "AVID HIFI",
    "category": "Antivibracijske Baze/Platforme",
    "series": "Nije specificirano",
    "description": "Antivibracijska podloga za hi-fi komponente koja poboljšava kvalitetu zvuka apsorbiranjem vibracija.",
    "longDescription": "AVID HIFI Platform je specijalizirana antivibracijska podloga dizajnirana da značajno poboljša kvalitetu zvuka vaših hi-fi komponenti apsorbiranjem neželjenih vibracija. Izrađena je od guste MDF ploče koja efikasno prigušuje vibracije i pruža krutu površinu. Platforma koristi Sorbothane u svojim nogama za dodatnu apsorpciju vibracija, što doprinosi čišćem i detaljnijem zvuku. Sa nosivošću do 50kg i dimenzijama 450 x 40 x 385 mm (ŠxVxD), pogodna je za gramofone, CD playere, streamere i pojačala. Dostupna je u crnoj boji i boji antiknog hrasta, omogućavajući estetsko uklapanje u vaš sistem. Težina joj je 2.5kg.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/a3b18a/ffffff?text=AVID+Platform",
    "specifications": [
      "Boja: Crna (također dostupna u Antique Oak)",
      "Nosivost: Do 50kg",
      "Materijali: Gusti MDF, Sorbothane",
      "Dimenzije (ŠxVxD): 450 x 40 x 385 mm",
      "Težina: 2.5 kg",
      "Jamstvo: 2 Godine proizvođača",
      "Ključne značajke: Trenutno poboljšanje zvuka, poboljšana zvučna slika i pozornica, glađa, prirodna tonalna ravnoteža, podesiva razina"
    ]
  },
  {
    "name": "Isorak Stand",
    "brand": "AVID HIFI",
    "category": "Hi-Fi Stalci",
    "series": "Isorak",
    "description": "Varijabilni High End hi-fi stalak za audio/video komponente, dizajniran za maksimalne performanse.",
    "longDescription": "AVID HIFI Isorak Stand je varijabilni High End hi-fi stalak dizajniran za audio i video komponente, s ciljem maksimiziranja njihovih performansi. Ovaj stalak pruža stabilnu i izoliranu platformu, smanjujući neželjene vibracije koje mogu degradirati kvalitetu zvuka. Njegov varijabilni dizajn omogućava prilagodbu različitim komponentama i postavkama, nudeći fleksibilnost u organizaciji vašeg audio sistema. S cijenom od 523,90 € po setu, Isorak Stand je investicija u poboljšanje transparentnosti i dinamike zvuka. Dostupnost je na upit, s datumom isporuke koji će biti specificiran. Sadrži police s kvalitetnom završnom obradom, utore za difuziju vibracija, solidne aluminijske stupove i integrirano upravljanje kablovima.",
    "price": "523,90 € / set",
    "imageUrl": "https://placehold.co/400x300/a3b18a/ffffff?text=AVID+Isorak+Stand",
    "specifications": [
      "Tip: Varijabilni High End hi-fi stalak",
      "Namjena: Audio/Video komponente",
      "Materijali: Kvalitetno završene police, solidni aluminijski stupovi",
      "Značajke: Utori za difuziju vibracija, integrirano upravljanje kablovima",
      "Dostupnost: Na upit - datum isporuke bit će specificiran"
    ]
  },
  {
    "name": "Isopuk 5",
    "brand": "AVID HIFI",
    "category": "Antivibracijske Podloge",
    "series": "Isopuk",
    "description": "Vrlo učinkovita antivibracijska podloga za audio/video komponente.",
    "longDescription": "AVID HIFI ISOPUK 5 je visoko učinkovita antivibracijska podloga namijenjena za audio i video komponente. Dizajnirana je da smanji prijenos vibracija, čime se poboljšava jasnoća i preciznost zvuka. Dostupna je u dvije razine tvrdoće, omogućavajući korisnicima da odaberu optimalnu opciju ovisno o težini i karakteristikama komponente. Idealna je za postavljanje ispod izvornih komponenti, pretpojačala, DAC-ova ili bilo kojeg drugog dijela Hi-Fi sistema gdje je vibracija potencijalni problem. Nudi otvoreniji, dinamičniji zvuk i bolju muzičku rezoluciju.",
    "price": "od 52,40 € / kom",
    "imageUrl": "https://placehold.co/400x300/a3b18a/ffffff?text=AVID+ISOPUK+5",
    "specifications": [
      "Tip: Antivibracijska podloga",
      "Namjena: Audio/Video komponente",
      "Dostupnost: U dvije razine tvrdoće",
      "Značajke: Otvoreniji dinamički zvuk, bolja muzička rezolucija, uklanja vibracije šasije, blokira vibracije podrške"
    ]
  },
  {
    "name": "Isopuk 7",
    "brand": "AVID HIFI",
    "category": "Antivibracijske Podloge",
    "series": "Isopuk",
    "description": "Vrlo učinkovita antivibracijska podloga za audio/video komponente, s opcijom dvije razine tvrdoće.",
    "longDescription": "AVID HIFI ISOPUK 7 je naprednija verzija antivibracijske podloge, slična modelu ISOPUK 5, ali s potencijalnim poboljšanjima ili specifičnim karakteristikama. Također je dizajnirana za visoko učinkovito smanjenje vibracija kod audio i video komponenti, poboljšavajući jasnoću i kvalitetu reprodukcije zvuka. Dostupna je u dvije razine tvrdoće, što korisnicima omogućava da odaberu najprikladniju opciju ovisno o težini i rezonantnim karakteristikama svojih uređaja. Nudi pristupačno rješenje za optimizaciju Hi-Fi sistema.",
    "price": "od 52,40 € / kom",
    "imageUrl": "https://placehold.co/400x300/a3b18a/ffffff?text=AVID+ISOPUK+7",
    "specifications": [
      "Tip: Antivibracijska podloga",
      "Namjena: Audio/Video komponente",
      "Dostupnost: U dvije razine tvrdoće",
      "Značajke: Smanjuje vibracije, poboljšava kvalitetu zvuka"
    ]
  },
  {
    "name": "Isoshelf Equipment Support",
    "brand": "AVID HIFI",
    "category": "Police za opremu",
    "series": "Isoshelf",
    "description": "Sustav podrške za opremu dizajniran za optimalnu izolaciju i smještaj audio komponenti.",
    "longDescription": "AVID HIFI Isoshelf Equipment Support je modularni sustav polica dizajniran za optimalnu izolaciju i smještaj hi-fi komponenti. Fokusiran je na smanjenje prijenosa vibracija unutar sustava, osiguravajući da svaka komponenta radi u najboljim mogućim uvjetima. Izrađen od kvalitetnih materijala, pruža stabilnu i estetski privlačnu platformu za cijeli vaš audio sustav.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/6b705c/ffffff?text=AVID+Isoshelf",
    "specifications": [
      "Tip: Modularni sustav polica/podloga",
      "Namjena: Podrška za audio/video komponente",
      "Značajke: Optimalna izolacija, smanjenje vibracija"
    ]
  },
  {
    "name": "Reference Cable Range",
    "brand": "AVID HIFI",
    "category": "Kablovi",
    "series": "Reference",
    "description": "Raspon visokokvalitetnih kablova (interkonekcijski, zvučnički) dizajniranih za minimalan gubitak signala.",
    "longDescription": "AVID HIFI Reference Cable Range obuhvaća visokokvalitetne interkonekcijske i zvučničke kablove, dizajnirane za minimalan gubitak signala i maksimalnu transparentnost u prijenosu zvuka. Izrađeni su od pažljivo odabranih materijala i s preciznim inženjeringom kako bi osigurali da audio signal ostane što vjerniji originalu. Idealni su za uparivanje s AVID HIFI komponentama, ali i s drugim high-end audio sustavima koji zahtijevaju najbolje u prijenosu signala.",
    "price": "Nije dostupno",
    "imageUrl": "https://placehold.co/400x300/8d9981/ffffff?text=AVID+Reference+Cables",
    "specifications": [
      "Tip: Interkonekcijski kablovi, Zvučnički kablovi",
      "Kategorija: Referentna klasa",
      "Performanse: Minimalan gubitak signala, maksimalna transparentnost"
    ]
  }
]
